In [1]:
import pandas as pd

In [100]:
### Define the Series
sales = pd.Series([10,20,30,40,50,60,70,80,90,100,"Basha"])
sales

0        10
1        20
2        30
3        40
4        50
5        60
6        70
7        80
8        90
9       100
10    Basha
dtype: object

#### Slicing and Indexing

In [16]:
#### Slicing
print(sales[5])
print("---------")
###Indexing
print(sales[2:5])

60
---------
2    30
3    40
4    50
dtype: int64

#### Indexing values and datatypes

In [17]:
print(sales.index)
print("---------")
print(sales.values)
print("---------")
print(sales.dtype)

RangeIndex(start=0, stop=10, step=1)
---------
[ 10  20  30  40  50  60  70  80  90 100]
---------
int64

#### Methods in Series

In [22]:
#### Head Method

print(sales.head())
print("-------------------")
print(sales.head(7))

0    10
1    20
2    30
3    40
4    50
dtype: int64
-------------------
0    10
1    20
2    30
3    40
4    50
5    60
6    70
dtype: int64

In [24]:
### Tail 
print(sales.tail())
print(sales.tail(6))

5     60
6     70
7     80
8     90
9    100
dtype: int64
4     50
5     60
6     70
7     80
8     90
9    100
dtype: int64

In [39]:
#### Sort Values
series = pd.Series([45,96,87,45,63,10,None])
print(series.sort_values().tail())
print(series.sort_values().head())

3    45.0
4    63.0
2    87.0
1    96.0
6     NaN
dtype: float64
5    10.0
0    45.0
3    45.0
4    63.0
2    87.0
dtype: float64

In [40]:
#### Count fuction
print(series.count)

<bound method Series.count of 0    45.0
1    96.0
2    87.0
3    45.0
4    63.0
5    10.0
6     NaN
dtype: float64>

In [47]:
### isnull
series = pd.Series([45,96,87,45,63,10,None])
print(series.isnull())
print(series.notnull())

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool
0     True
1     True
2     True
3     True
4     True
5     True
6    False
dtype: bool

In [49]:
#### fillna 
series = pd.Series([45,96,87,45,63,10,None])
series = series.fillna(100)
series

0     45.0
1     96.0
2     87.0
3     45.0
4     63.0
5     10.0
6    100.0
dtype: float64

In [51]:
### dropna 
series = pd.Series([45,96,87,45,63,10,None])
series = series.dropna()
series.count

<bound method Series.count of 0    45.0
1    96.0
2    87.0
3    45.0
4    63.0
5    10.0
dtype: float64>

#### DataFrames

In [98]:
student = {
    "Name": ["aaa", "bbb", "ccc", "ddd", "eee"],
    "age": [12, 52, 85, 63, 45],
    "marks": [12, 85, 45, None, 90],
    "address":["XXX","YYY","ZZZ","PPP","QQQ"]
}

df = pd.DataFrame(student)
df

  Name  age  marks address
0  aaa   12   12.0     XXX
1  bbb   52   85.0     YYY
2  ccc   85   45.0     ZZZ
3  ddd   63    NaN     PPP
4  eee   45   90.0     QQQ

In [86]:
df.shape

(5, 4)

In [ ]:
df.columns

Index(['Name', 'age', 'marks', 'address'], dtype='object')

#### Accesssing the Data

In [87]:
#iloc → Position-based indexing
df.iloc[1:3]

  Name  age  marks address
1  bbb   52     85     YYY
2  ccc   85     45     ZZZ

In [88]:
#loc → Label-based indexing
print(df.loc[1,"Name"])
print(df.loc[1:3])

bbb
  Name  age  marks address
1  bbb   52     85     YYY
2  ccc   85     45     ZZZ
3  ddd   63     85     PPP

In [91]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     5 non-null      object
 1   age      5 non-null      int64
 2   marks    4 non-null      float64
 3   address  5 non-null      object
dtypes: float64(1), int64(1), object(2)
memory usage: 292.0+ bytes

In [93]:
df.describe()

             age      marks
count   5.000000   4.000000
mean   51.400000  58.000000
std    26.726391  36.687873
min    12.000000  12.000000
25%    45.000000  36.750000
50%    52.000000  65.000000
75%    63.000000  86.250000
max    85.000000  90.000000

#### Adding new Coloumns

In [96]:
df['state'] = ['Karnataka','Maharastra','Kerala','Tamilnadu','Mumbai']
df

  Name  age  marks address       state
0  aaa   12   12.0     XXX   Karnataka
1  bbb   52   85.0     YYY  Maharastra
2  ccc   85   45.0     ZZZ      Kerala
3  ddd   63    NaN     PPP   Tamilnadu
4  eee   45   90.0     QQQ      Mumbai